jetpax/ESP32-sveltekit/lib/ovms/ovms_events.cpp
/*
;    Project:       Open Vehicle Monitor System
;    Date:          14th March 2017
;
;    Changes:
;    1.0  Initial release
;
;    (C) 2011       Michael Stegen / Stegen Electronics
;    (C) 2011-2017  Mark Webb-Johnson
;    (C) 2011        Sonny Chen @ EPRO/DX
;
; Permission is hereby granted, free of charge, to any person obtaining a copy
; of this software and associated documentation files (the "Software"), to deal
; in the Software without restriction, including without limitation the rights
; to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
; copies of the Software, and to permit persons to whom the Software is
; furnished to do so, subject to the following conditions:
;
; The above copyright notice and this permission notice shall be included in
; all copies or substantial portions of the Software.
;
; THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
; IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
; FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
; AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
; LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
; OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
; THE SOFTWARE.

OvmsEvents CLASS:
  Manages event registration, signaling, and handling.
  Provides a task (EventTask) to process events asynchronously.

Event queue (m_taskqueue):
  Stores events waiting to be processed.

Event map (m_map):
  Maps event names to lists of registered callbacks.
  
Timers (m_timers, m_timers_mutex):
  Used for scheduling delayed events.
  
Core Functions:
  RegisterEvent:
    Registers a callback function to be invoked when a specific event occurs.
  SignalEvent:
    Signals an event, immediately or after a delay.
    Adds the event to the queue or schedules a timer.
  EventTask:
    Runs continuously, processing events from the queue.
    Finds matching callbacks for each event.
    Calls the callbacks.
    Implements a watchdog timer for reliability.
  Additional Features:
    Event tracing (m_trace):
      Logs events for debugging.
    Event status commands:
      Enable viewing registered events and queue status.
    Delayed events:
      Allows scheduling events for future execution.
    Queue overflow handling:
      Prevents queue saturation and logs warnings.
    Memory management:
      Uses malloc for memory allocation.
*/

static const char *TAG = "ovms-events";

#include <string.h>
#include <stdio.h>
#include <esp_task_wdt.h>
#include "global.h"
#include "ovms_events.h"
#include "ovms_command.h"
#ifdef CONFIG_OVMS_SC_JAVASCRIPT_DUKTAPE
#include "ovms_script.h"
#endif
#include "ovms_boot.h"
#if ESP_IDF_VERSION_MAJOR >= 4
#include <esp_netif_types.h>
#include <esp_eth_com.h>
#endif
#if ESP_IDF_VERSION_MAJOR >= 5
#include <esp_wifi_types.h>
#endif

#ifdef CONFIG_OVMS_COMP_OTA
#include "ovms_ota.h"
#endif

#include "esp_log.h"

typedef void (*event_signal_done_fn)(const char* event, void* data);

bool EventMap::GetCompletion(OvmsWriter* writer, const char* token) const
  {
  unsigned int index = 0;
  bool match = false;
  writer->SetCompletion(index, NULL);
  if (token)
    {
    size_t len = strlen(token);
    for (const_iterator it = begin(); it != end(); ++it)
      {
      if (it->first.compare("*") == 0)
        continue;
      if (it->first.compare(0, len, token) == 0)
        {
        writer->SetCompletion(index++, it->first.c_str());
        match = true;
        }
      }
    }
  return match;
  }

void EventStdFree(const char* event, void* data)
  {
  free(data);
  }

void EventLaunchTask(void *pvParameters)
  {
  // OvmsEvents* me = (OvmsEvents*)pvParameters;

  // me->EventTask();

  OvmsEvents::instance(TAG).EventTask();

  }

void event_trace(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  if (strcmp(cmd->GetName(),"on")==0)
     OvmsEvents::instance(TAG).m_trace = true;
  else
     OvmsEvents::instance(TAG).m_trace = false;

  writer->printf("Event tracing is now %s\n",cmd->GetName());
  }

void event_status(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  writer->printf("Event map has %d listeners, and queue has %d/%d entries\n",
     OvmsEvents::instance(TAG).Map().size(),
    uxQueueMessagesWaiting( OvmsEvents::instance(TAG).m_taskqueue),
    CONFIG_OVMS_HW_EVENT_QUEUE_SIZE);

  EventCallbackEntry* cbe =  OvmsEvents::instance(TAG).m_current_callback;
  if (cbe != NULL)
    {
    writer->printf("Currently dispatching:\n");
    writer->printf("  Event: %s\n", OvmsEvents::instance(TAG).m_current_event.c_str());
    writer->printf("  To:    %s\n",cbe->m_caller.c_str());
    writer->printf("  For:   %" PRIu32 " second(s)\n",monotonictime- OvmsEvents::instance(TAG).m_current_started);
    }
  }

void event_list(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  std::string event;
  for (EventMap::const_iterator itm= OvmsEvents::instance(TAG).Map().begin(); itm !=  OvmsEvents::instance(TAG).Map().end(); ++itm)
    {
    if (argc > 0 && itm->first.find(argv[0]) == std::string::npos)
      continue;
    event.append(itm->first);
    event.append(":  ");
    EventCallbackList* el = itm->second;
    for (EventCallbackList::iterator itc=el->begin(); itc!=el->end(); )
      {
      EventCallbackEntry* ec = *itc;
      event.append(ec->m_caller);
      if (++itc != el->end())
        event.append(", ");
      }
    event.append("\n\r");
    }
  writer->printf("%s", event.c_str());
  }

int event_validate(OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv, bool complete)
  {
  int argpos = 0;
  for (int i=0; i < argc; i++)
    argpos += (argv[i][0] != '-') ? 1 : 0;
  if (argpos == 1 &&  OvmsEvents::instance(TAG).Map().GetCompletion(writer, argv[argc-1]))
    return argc;
  return -1;
  }

void event_raise(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  std::string event;
  uint32_t delay_ms = 0;

