jetpax/ESP32-sveltekit/lib/ovms/ovms_events.cpp
  for (int i=0; i<argc; i++)
    {
    if (argv[i][0] == '-')
      {
      if (argv[i][1] != 'd')
        {
        cmd->PutUsage(writer);
        return;
        }
      delay_ms = atol(argv[i]+2);
      }
    else
      event = argv[i];
    }

  if (delay_ms)
    {
    writer->printf("Raising event in %" PRIu32 " ms: %s\n", delay_ms, event.c_str());
     OvmsEvents::instance(TAG).SignalEvent(event, NULL, (size_t)0, delay_ms);
    }
  else
    {
    writer->printf("Raising event: %s\n", event.c_str());
     OvmsEvents::instance(TAG).SignalEvent(event, NULL);
    }
  }

#ifdef CONFIG_OVMS_SC_JAVASCRIPT_DUKTAPE

static duk_ret_t DukOvmsRaiseEvent(duk_context *ctx)
  {
  const char *event = duk_to_string(ctx,0);
  uint32_t delay_ms = duk_is_number(ctx,1) ? duk_to_uint32(ctx,1) : 0;

  if (event != NULL)
    {
     OvmsEvents::instance(TAG).SignalEvent(event, NULL, (size_t)0, delay_ms);
    }
  return 0;  /* no return value */
  }

#endif // #ifdef CONFIG_OVMS_SC_JAVASCRIPT_DUKTAPE

// Construct On First Use instantiation 
OvmsEvents &OvmsEvents::instance(const char* caller) {
    static bool initialized = false;
    if (!initialized) {
      initialized = true;
        ESP_LOGI(TAG, "%s COFU by %s", TAG, caller);
    }
    static OvmsEvents _instance;
    return _instance;
}

const char* OvmsEvents::name() const {
    return TAG;
}

OvmsEvents::OvmsEvents()
  {
  m_current_callback = NULL;

#ifdef CONFIG_OVMS_DEV_DEBUGEVENTS
  m_trace = true;
#else
  m_trace = false;
#endif // #ifdef CONFIG_OVMS_DEV_DEBUGEVENTS


ESP_ERROR_CHECK(esp_event_handler_instance_register(ESP_EVENT_ANY_BASE, ESP_EVENT_ANY_ID, ReceiveSystemEvent, (void*)this, &event_handler_instance));


  // Register our commands
  OvmsCommand* cmd_event = OvmsCommandApp::instance(TAG).RegisterCommand("event","EVENT framework", event_status, "", 0, 0, false);
  cmd_event->RegisterCommand("status","Show status of event system",event_status);
  cmd_event->RegisterCommand("list","List registered events",event_list,"[<key>]", 0, 1);
  cmd_event->RegisterCommand("raise","Raise a textual event",event_raise,"[-d<delay_ms>] <event>", 1, 2, true, event_validate);
  OvmsCommand* cmd_eventtrace = cmd_event->RegisterCommand("trace","EVENT trace framework");
  cmd_eventtrace->RegisterCommand("on","Turn event tracing ON",event_trace);
  cmd_eventtrace->RegisterCommand("off","Turn event tracing OFF",event_trace);

  m_taskqueue = xQueueCreate(CONFIG_OVMS_HW_EVENT_QUEUE_SIZE,sizeof(event_queue_t));

  // start main event loop on CPU1
  // use lambda function to capture the this pointer. 
    xTaskCreatePinnedToCore([](void* pvParameters) {
        static_cast<OvmsEvents*>(pvParameters)->EventTask();
    }, "OVMS Events", 8192, (void*)this, 8, &m_taskid, CORE(1));

  #ifdef CONFIG_OVMS_SC_JAVASCRIPT_DUKTAPE
  DuktapeObjectRegistration* dto = new DuktapeObjectRegistration("OvmsEvents");
  dto->RegisterDuktapeFunction(DukOvmsRaiseEvent, 2, "Raise");
  MyDuktape.RegisterDuktapeObject(dto);
  #endif // #ifdef CONFIG_OVMS_SC_JAVASCRIPT_DUKTAPE
  }

OvmsEvents::~OvmsEvents()
  {
  ESP_ERROR_CHECK(esp_event_handler_instance_unregister(ESP_EVENT_ANY_BASE, ESP_EVENT_ANY_ID, event_handler_instance));
  ESP_ERROR_CHECK(esp_event_loop_delete_default());
  }


//=====================================================================================================================
// MAIN OVMS EVENT LOOP
//=====================================================================================================================
void OvmsEvents::EventTask()
  {
  event_queue_t msg;
  ESP_LOGD(TAG, "EVENT LOOP started on CPU%d",xPortGetCoreID());
  esp_task_wdt_add(NULL); // if all is well, should get reset every second by Ticker1 event
  while(1)
    {
    // ESP_LOGD(TAG,  "RxQ size '%d'", uxQueueMessagesWaiting(m_taskqueue));
    if (xQueueReceive(m_taskqueue, &msg, pdMS_TO_TICKS(5000)) == pdTRUE)
      {
      // esp_task_wdt_reset(); // Reset WATCHDOG timer for this task
      // ESP_LOGD(TAG, "QRx: %d:%s", msg.type, msg.body.signal.event);
      switch(msg.type)
        {
        case EVENT_none:
          break;
        case EVENT_signal:
          m_current_event = msg.body.signal.event;
          HandleQueueSignalEvent(&msg);
          // ESP_LOGD(TAG,  "Feed wdt on %s", m_current_event.c_str());
          esp_task_wdt_reset(); // Reset WATCHDOG timer for this task
          m_current_event.clear();
          break;
        default:
          break;
        }
      }
    else
      {
  #ifdef CONFIG_OVMS_COMP_OTA
        // Timeout on xQueueReceive: ignore during OTA flash job:
        OvmsMutexLock m_lock(&MyOTA.m_flashing, 0);
        if (!m_lock.IsLocked())
          continue;
  #endif
        // …no OTA flashing in progress => abort:
        ESP_LOGE(TAG, "EventTask: [QueueTimeout] timer service / ticker timer has died => aborting");
        m_current_event = "[QueueTimeout]";
        m_current_started = monotonictime - 5;
        OvmsCommandApp::instance(TAG).CloseLogfile();
        vTaskDelay(pdMS_TO_TICKS(100));
        // abort();
      }
    }
  }

void OvmsEvents::HandleQueueSignalEvent(event_queue_t* msg)
  {
  // // Log everything but the ticker & clock signals
  if (!startsWith(m_current_event, "ticker.") && !startsWith(m_current_event, "clock."))
    {
    if (m_trace)
        ESP_LOGI(TAG, "HandleQsignal %s",m_current_event.c_str());
    else
        ESP_LOGI(TAG, "HandleQsignal %s",m_current_event.c_str());
    }

  auto k = m_map.find(m_current_event);
  if (k != m_map.end())
    {
    EventCallbackList* el = k->second;
    if (el)
      {
      for (EventCallbackList::iterator itc=el->begin(); itc!=el->end(); ++itc)
        {
        m_current_started = monotonictime;
        m_current_callback = *itc;
        m_current_callback->m_callback(m_current_event, msg->body.signal.data);
        m_current_callback = NULL;
        }
      }
    }

  k = m_map.find("*");
  if (k != m_map.end())
    {
    EventCallbackList* el = k->second;
    if (el)
      {
      for (EventCallbackList::iterator itc=el->begin(); itc!=el->end(); ++itc)
        {
        m_current_started = monotonictime;
        m_current_callback = *itc;
        m_current_callback->m_callback(m_current_event, msg->body.signal.data);
        m_current_callback = NULL;
        }
      }
    }

  m_current_started = monotonictime;
  // MyScripts.EventScript(m_current_event, msg->body.signal.data);

