jetpax/ESP32-sveltekit/lib/ovms/ovms_events.cpp
  FreeQueueSignalEvent(msg);
  }

void OvmsEvents::FreeQueueSignalEvent(event_queue_t* msg)
  {
  if (msg->body.signal.donefn != NULL)
    {
    msg->body.signal.donefn(msg->body.signal.event, msg->body.signal.data);
    }
  free(msg->body.signal.event);
  }

void OvmsEvents::RegisterEvent(std::string caller, std::string event, EventCallback callback)
  {
  ESP_LOGI(TAG,"registering event %s for caller %s",event.c_str(),caller.c_str());
  auto k = m_map.find(event);
  if (k == m_map.end())
    {
    m_map[event] = new EventCallbackList();
    k = m_map.find(event);
    }
  if (k == m_map.end())
    {
    ESP_LOGE(TAG, "Problem registering event %s for caller %s",event.c_str(),caller.c_str());
    return;
    }

  EventCallbackList *el = k->second;
  el->push_back(new EventCallbackEntry(caller,callback));
  }

void OvmsEvents::DeregisterEvent(std::string caller)
  {
  EventMap::iterator itm=m_map.begin();
  while (itm!=m_map.end())
    {
    EventCallbackList* el = itm->second;
    EventCallbackList::iterator itc=el->begin();
    while (itc!=el->end())
      {
      EventCallbackEntry* ec = *itc;
      if (ec->m_caller == caller)
        {
        itc = el->erase(itc);
        delete ec;
        }
      else
        {
        ++itc;
        }
      }
    if (el->empty())
      {
      itm = m_map.erase(itm);
      delete el;
      }
    else
      {
      ++itm;
      }
    }
  }

static void CheckQueueOverflow(const char* from, char* event)
  {
  EventCallbackEntry* cbe =  OvmsEvents::instance(TAG).m_current_callback;
  if (cbe != NULL)
    {
    ESP_LOGE(TAG, "%s: queue overflow (running %s->%s for %" PRIu32 " sec), event '%s' dropped",
      from,
       OvmsEvents::instance(TAG).m_current_event.c_str(),
      cbe->m_caller.c_str(),
      monotonictime- OvmsEvents::instance(TAG).m_current_started,
      event);
    }
  else
    {
    ESP_LOGE(TAG, "%s: queue overflow, event '%s' dropped", from, event);
    }
  if (strncmp(event, "ticker.", 7) != 0)
    {
    // We've dropped a potentially important event, system is instable now.
    // As the event queue is full, a normal reboot is no option, so…
#ifdef CONFIG_OVMS_COMP_OTA
    // …wait for a running OTA job to finish…
    OvmsMutexLock m_lock(&MyOTA.m_flashing);
#endif
    // …then abort:
    ESP_LOGE(TAG, "%s: lost important event => aborting", from);
    OvmsCommandApp::instance(TAG).CloseLogfile();
    vTaskDelay(pdMS_TO_TICKS(100));
    abort();
    }
  }

void OvmsEvents::SignalScheduledEvent(TimerHandle_t timer)
  {
  OvmsMutexLock lock(& OvmsEvents::instance(TAG).m_timers_mutex);

  // retrieve timer payload message (event):
  event_queue_t* msg = (event_queue_t*) pvTimerGetTimerID(timer);
  vTimerSetTimerID(timer, NULL);
  if (!msg)
    {
    // This should no longer happen, but keeping the test doesn't hurt.
    // See: https://github.com/espressif/esp-idf/issues/8234
    ESP_LOGW(TAG, "SignalScheduledEvent: duplicate callback invocation detected");
    return;
    }

  // … and pass on to event task:
  if (xQueueSend( OvmsEvents::instance(TAG).m_taskqueue, msg, 0) != pdTRUE)
    {
    CheckQueueOverflow("SignalScheduledEvent", msg->body.signal.event);
     OvmsEvents::instance(TAG).FreeQueueSignalEvent(msg);
    }

  delete msg;
   OvmsEvents::instance(TAG).m_timer_active[timer] = false;
  }

bool OvmsEvents::ScheduleEvent(event_queue_t* msg, uint32_t delay_ms)
  {
  OvmsMutexLock lock(&m_timers_mutex);
  TimerHandle_t timer;
  TimerList::iterator it;
  event_queue_t *msgdup = new event_queue_t(*msg);
  int timerticks = pdMS_TO_TICKS(delay_ms); if (timerticks<1) timerticks=1;

  if (!msgdup)
    {
    ESP_LOGE(TAG, "ScheduleEvent: message duplication failed, event dropped");
    return false;
    }

  // find available timer:
  for (it = m_timers.begin(); it != m_timers.end(); it++)
    {
    timer = *it;
    // Note: xTimerIsTimerActive() must not be used here, it has a
    //  multicore race condition with FreeRTOS V8.2.0 (esp-idf 3.3):
    //  an expired timer is removed from the active list before its
    //  callback is executed, so while the callback is running, the
    //  timer already appears to be free. Workaround is to use our
    //  own timer status map:
    if (!m_timer_active[timer])
      break;
    }
  if (it == m_timers.end())
    {
    // create & register a new timer:
    ESP_LOGI(TAG, "ScheduleEvent: creating new timer");
    timer = xTimerCreate("ScheduleEvent", timerticks, pdFALSE, NULL, SignalScheduledEvent);
    if (!timer)
      {
      ESP_LOGE(TAG, "ScheduleEvent: xTimerCreate failed, event dropped");
      delete msgdup;
      return false;
      }
    m_timers.push_back(timer);
    m_timer_active[timer] = false;
    }

  // set payload, update & start the timer:
  vTimerSetTimerID(timer, msgdup);
  if (xTimerChangePeriod(timer, timerticks, 0) != pdPASS) // also starts the timer
    {
    ESP_LOGE(TAG, "ScheduleEvent: xTimerChangePeriod failed, event dropped");
    vTimerSetTimerID(timer, NULL);
    delete msgdup;
    return false;
    }

  m_timer_active[timer] = true;
  return true;
  }

void OvmsEvents::SignalEvent(std::string event, void* data, event_signal_done_fn callback /*=NULL*/,
                             uint32_t delay_ms /*=0*/)
  {
  ESP_LOGD(TAG, "Signal EVENT '%s'", event.c_str());
  event_queue_t msg;
  memset(&msg, 0, sizeof(msg));

  msg.type = EVENT_signal;
  msg.body.signal.event = (char*)malloc(event.size()+1);
  strcpy(msg.body.signal.event, event.c_str());
  msg.body.signal.data = data;
  msg.body.signal.donefn = callback;

  if (delay_ms == 0)
    {
    if (xQueueSend(m_taskqueue, &msg, 0) != pdTRUE)
      {
      ESP_LOGE(TAG, "Signal EVENT FAILED");
      CheckQueueOverflow("SignalEvent", msg.body.signal.event);
      FreeQueueSignalEvent(&msg);
      }
    }
  else
    {
    if (ScheduleEvent(&msg, delay_ms) != true)
      {
      ESP_LOGE(TAG, "SignalEvent: no timer available, event '%s' dropped", msg.body.signal.event);
      FreeQueueSignalEvent(&msg);
      }
    }
  }

