jetpax/ESP32-sveltekit/lib/ovms/ovms_events.cpp
void OvmsEvents::SignalEvent(std::string event, void* data, size_t length,
                             uint32_t delay_ms /*=0*/)
  {
  event_queue_t msg;
  memset(&msg, 0, sizeof(msg));

  msg.type = EVENT_signal;
  msg.body.signal.event = (char*)malloc(event.size()+1);
  strcpy(msg.body.signal.event, event.c_str());
  if (data != NULL)
    {
    msg.body.signal.data = malloc(length);
    memcpy(msg.body.signal.data, data, length);
    msg.body.signal.donefn = EventStdFree;
    }
  else
    {
    msg.body.signal.data = NULL;
    msg.body.signal.donefn = NULL;
    }

  if (delay_ms == 0)
    {
    if (xQueueSend(m_taskqueue, &msg, 0) != pdTRUE)
      {
      CheckQueueOverflow("SignalEvent", msg.body.signal.event);
      FreeQueueSignalEvent(&msg);
      }
    }
  else
    {
    if (ScheduleEvent(&msg, delay_ms) != true)
      {
      ESP_LOGE(TAG, "SignalEvent: no timer available, event '%s' dropped", msg.body.signal.event);
      FreeQueueSignalEvent(&msg);
      }
    }
  }

#if ESP_IDF_VERSION_MAJOR >= 4
/* Handler for all events */
void OvmsEvents::ReceiveSystemEvent(void* handler_args, esp_event_base_t base, int32_t id, void* event_data)
  {
  OvmsEvents* e = (OvmsEvents*)handler_args;
  // e->SignalEvent("system.event",(void*)event_data, sizeof(system_event_t)); // used for legacy mdns approach only ?

  if (base == WIFI_EVENT)
    {
    switch (id)
      {
      case WIFI_EVENT_WIFI_READY:      // ESP32 WiFi ready
        e->SignalEvent("system.wifi.ready", NULL);
        break;
      case WIFI_EVENT_SCAN_DONE:       // ESP32 finish scanning AP
        e->SignalEvent("system.wifi.scan.done", event_data, sizeof(wifi_event_sta_scan_done_t));
        break;
      case WIFI_EVENT_STA_START:       // ESP32 station start
        e->SignalEvent("system.wifi.sta.start", NULL);
        break;
      case WIFI_EVENT_STA_STOP:        // ESP32 station stop
        e->SignalEvent("system.wifi.sta.stop", NULL);
        break;
      case WIFI_EVENT_STA_CONNECTED:   // ESP32 station connected to AP
        e->SignalEvent("system.wifi.sta.connected", event_data, sizeof(wifi_event_sta_connected_t));
        break;
      case WIFI_EVENT_STA_DISCONNECTED:  // ESP32 station disconnected from AP
        e->SignalEvent("system.wifi.sta.disconnected", event_data, sizeof(wifi_event_sta_disconnected_t));
        break;
      case WIFI_EVENT_STA_AUTHMODE_CHANGE:  // the auth mode of AP connected by ESP32 station changed
        e->SignalEvent("system.wifi.sta.authmodechange", event_data, sizeof(wifi_event_sta_authmode_change_t));
        break;
      case WIFI_EVENT_STA_WPS_ER_SUCCESS:  // ESP32 station wps succeeds in enrollee mode
        e->SignalEvent("system.wifi.sta.wpser.success", NULL);
        break;
      case WIFI_EVENT_STA_WPS_ER_FAILED:   // ESP32 station wps fails in enrollee mode
        e->SignalEvent("system.wifi.sta.wpser.failed", event_data, sizeof(wifi_event_sta_wps_fail_reason_t));
        break;
      case WIFI_EVENT_STA_WPS_ER_TIMEOUT:  // ESP32 station wps timeout in enrollee mode
        e->SignalEvent("system.wifi.sta.wpser.timeout", NULL);
        break;
      case WIFI_EVENT_STA_WPS_ER_PIN:      // ESP32 station wps pin code in enrollee mode
        e->SignalEvent("system.wifi.sta.wpser.pin", event_data, sizeof(wifi_event_sta_wps_er_pin_t));
        break;
      case WIFI_EVENT_AP_START:            // ESP32 soft-AP start
        e->SignalEvent("system.wifi.ap.start", NULL);
        break;
      case WIFI_EVENT_AP_STOP:             // ESP32 soft-AP stop
        e->SignalEvent("system.wifi.ap.stop", NULL);
        break;
      case WIFI_EVENT_AP_STACONNECTED:     // a station connected to ESP32 soft-AP
        e->SignalEvent("system.wifi.ap.sta.connected", event_data, sizeof(wifi_event_ap_staconnected_t));
        break;
      case WIFI_EVENT_AP_STADISCONNECTED:  // a station disconnected from ESP32 soft-AP
        e->SignalEvent("system.wifi.ap.sta.disconnected", event_data, sizeof(wifi_event_ap_stadisconnected_t));
        break;
      case WIFI_EVENT_AP_PROBEREQRECVED:   // Receive probe request packet in soft-AP interface
        e->SignalEvent("system.wifi.ap.proberx", event_data, sizeof(wifi_event_ap_probe_req_rx_t));
        break;
      default:
       break;
      }
    }
  else if (base == IP_EVENT)
    {
    switch (id)
      {
      case IP_EVENT_STA_GOT_IP:           // ESP32 station got IP from connected AP
        e->SignalEvent("network.interface.up", NULL);
        e->SignalEvent("system.wifi.sta.gotip", event_data, sizeof(ip_event_got_ip_t));
        break;
      case IP_EVENT_STA_LOST_IP:         // ESP32 station lost IP and the IP is reset to 0
        e->SignalEvent("system.wifi.sta.lostip", NULL);
        break;
      case IP_EVENT_AP_STAIPASSIGNED:    // ESP32 soft-AP assigned an IP to a connected station
        e->SignalEvent("system.wifi.ap.sta.ipassigned", NULL);
        break;
      case IP_EVENT_GOT_IP6:      // ESP32 station or ap interface v6IP addr is preferred
        e->SignalEvent("system.wifi.ap.sta.gotip6", event_data, sizeof(ip_event_got_ip6_t));
        break;
      case IP_EVENT_ETH_GOT_IP:          // ESP32 ethernet got IP from connected AP
        e->SignalEvent("system.eth.gotip",  event_data, sizeof(ip_event_got_ip_t));
        break;
      default:
       break;
      }
    }
  else if (base == ETH_EVENT)
    {
    switch (id)
      {
      case ETHERNET_EVENT_START:           // ESP32 ethernet start
        e->SignalEvent("system.eth.start", NULL);
        break;
      case ETHERNET_EVENT_STOP:            // ESP32 ethernet stop
        e->SignalEvent("system.eth.stop", NULL);
        break;
      case ETHERNET_EVENT_CONNECTED:       // ESP32 ethernet phy link up
        e->SignalEvent("system.eth.connected", NULL);
        break;
      case ETHERNET_EVENT_DISCONNECTED:    // ESP32 ethernet phy link down
        e->SignalEvent("system.eth.disconnected", NULL);
        break;
      default:
       break;
      }
    }
  }

#else

esp_err_t OvmsEvents::ReceiveSystemEvent(void *ctx, system_event_t *event)
  {
  OvmsEvents* e = (OvmsEvents*)ctx;
  e->SignalEvent("system.event",(void*)event,sizeof(system_event_t));
  e->SignalSystemEvent(event);
  return ESP_OK;
  }

void OvmsEvents::SignalSystemEvent(system_event_t *event)
  {
  switch (event->event_id)
    {
    case SYSTEM_EVENT_WIFI_READY:      // ESP32 WiFi ready
      SignalEvent("system.wifi.ready",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_SCAN_DONE:       // ESP32 finish scanning AP
      SignalEvent("system.wifi.scan.done",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_START:       // ESP32 station start
      SignalEvent("system.wifi.sta.start",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_STOP:        // ESP32 station stop
      SignalEvent("system.wifi.sta.stop",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_CONNECTED:   // ESP32 station connected to AP
      SignalEvent("system.wifi.sta.connected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_DISCONNECTED:  // ESP32 station disconnected from AP
      SignalEvent("system.wifi.sta.disconnected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_AUTHMODE_CHANGE:  // the auth mode of AP connected by ESP32 station changed
      SignalEvent("system.wifi.sta.authmodechange",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_GOT_IP:           // ESP32 station got IP from connected AP
      SignalEvent("network.interface.up", NULL);
      SignalEvent("system.wifi.sta.gotip",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_LOST_IP:         // ESP32 station lost IP and the IP is reset to 0
      SignalEvent("system.wifi.sta.lostip",(void*)&event->event_info);
      break;
    case SYSTEM_EVENT_STA_WPS_ER_SUCCESS:  // ESP32 station wps succeeds in enrollee mode
      SignalEvent("system.wifi.sta.wpser.success",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_WPS_ER_FAILED:   // ESP32 station wps fails in enrollee mode
      SignalEvent("system.wifi.sta.wpser.failed",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_WPS_ER_TIMEOUT:  // ESP32 station wps timeout in enrollee mode
      SignalEvent("system.wifi.sta.wpser.timeout",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_STA_WPS_ER_PIN:      // ESP32 station wps pin code in enrollee mode
      SignalEvent("system.wifi.sta.wpser.pin",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_START:            // ESP32 soft-AP start
      SignalEvent("system.wifi.ap.start",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_STOP:             // ESP32 soft-AP stop
      SignalEvent("system.wifi.ap.stop",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_STACONNECTED:     // a station connected to ESP32 soft-AP
      SignalEvent("system.wifi.ap.sta.connected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_STADISCONNECTED:  // a station disconnected from ESP32 soft-AP
      SignalEvent("system.wifi.ap.sta.disconnected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_STAIPASSIGNED:    // ESP32 soft-AP assigned an IP to a connected station
      SignalEvent("system.wifi.ap.sta.ipassigned",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_PROBEREQRECVED:   // Receive probe request packet in soft-AP interface
      SignalEvent("system.wifi.ap.proberx",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_AP_STA_GOT_IP6:      // ESP32 station or ap interface v6IP addr is preferred
      SignalEvent("system.wifi.ap.sta.gotip6",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_ETH_START:           // ESP32 ethernet start
      SignalEvent("system.eth.start",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_ETH_STOP:            // ESP32 ethernet stop
      SignalEvent("system.eth.stop",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_ETH_CONNECTED:       // ESP32 ethernet phy link up
      SignalEvent("system.eth.connected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_ETH_DISCONNECTED:    // ESP32 ethernet phy link down
      SignalEvent("system.eth.disconnected",(void*)&event->event_info,sizeof(event->event_info));
      break;
    case SYSTEM_EVENT_ETH_GOT_IP:          // ESP32 ethernet got IP from connected AP
      SignalEvent("system.eth.gotip",(void*)&event->event_info,sizeof(event->event_info));
      break;
    default:
     break;
    }
  }

#endif

EventCallbackEntry::EventCallbackEntry(std::string caller, EventCallback callback)
  {
  m_caller = caller;
  m_callback = callback;
  }

EventCallbackEntry::~EventCallbackEntry()
  {
  }
